range_variable = range(20, 51)
[20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]

range_variable = range(100, 151)
[100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150]

even_numbers_range = range(20, 51, 2)
[20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]

odd_numbers_range = range(11, 32, 2)
[11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31]

# თქვენი სახელი და გვარი
name_surname = "ანდრია რაფავა"

# ციკლი, რომელიც 10-ჯერ დაბეჭდავს
for i in range(10):
    print(name_surname)

for num in range(40, 61):
    print(num ** 3)

num1 = int(input("2"))
num2 = int(input("10"))
num3 = int(input("2"))

# დიაპაზონის შექმნა
range_variable = range(num1, num2, num3)

# ციკლი დიაპაზონზე და კვადრატების დაბეჭდვა
for num in range_variable:
    print(num ** 2)

# ცვლადის შექმნა
sum = 0

# ციკლი 5-დან 15-ის ჩათვლით
for num in range(5, 16):
    sum += num  # დამატება sum-ს

# საბოლოოდ sum-ის მნიშვნელობის დაბეჭდვა
print("sum =", sum)